{
  "title": "باغ کی مہم",
  "content": "باغ کی مہم\n\nعلی اور زینب اپنے دادا کے باغ میں کھیل رہے تھے۔ باغ میں کئی قسم کے پھول اور درخت تھے۔\n\n\"دیکھو! یہ تتلی کتنی خوبصورت ہے،\" زینب نے کہا۔\n\nعلی نے کہا، \"چلو، ہم اس کے پیچھے بھاگیں۔\"\n\nتتلی اڑتی ہوئی ایک پھول پر بیٹھ گئی۔ بچے قریب گئے تو تتلی نے اپنے خوبصورت پروں کو پھڑپھڑایا۔\n\n\"واہ! اس کے پروں پر کتنے خوبصورت رنگ ہیں،\" زینب نے حیرت سے کہا۔\n\nدادا نے قریب آ کر کہا، \"تتلیاں پھولوں کا رس پیتی ہیں۔ وہ پھولوں کو پولینیشن میں بھی مدد کرتی ہیں۔\"\n\n\"پولینیشن کیا ہے؟\" علی نے پوچھا۔\n\nدادا نے سمجھایا، \"یہ وہ عمل ہے جس سے پھول پھل بنتے ہیں۔ تتلیاں ایک پھول سے دوسرے پھول تک پولن لے جاتی ہیں۔\"\n\nزینب نے کہا، \"تو تتلیاں باغ کے لیے بہت اہم ہیں!\"\n\n\"بالکل درست،\" دادا نے مسکراتے ہوئے کہا۔ \"ہر چھوٹا جاندار قدرت میں اپنا اہم کردار ادا کرتا ہے۔\"\n\nبچوں نے اس دن باغ میں بہت کچھ سیکھا۔ وہ اب تتلیوں کو اور بھی زیادہ پیار کرنے لگے تھے۔",
  "lesson": "اس کہانی سے ہمیں یہ سبق ملتا ہے کہ قدرت میں ہر چھوٹا جاندار اپنا اہم کردار ادا کرتا ہے۔ تتلیاں جیسے چھوٹے جاندار بھی پھولوں کی افزائش میں اہم کردار ادا کرتے ہیں۔",
  "characters": [
    {
      "name": "علی",
      "description": "ایک بچہ جو باغ میں کھیلتا ہے"
    },
    {
      "name": "زینب",
      "description": "علی کی بہن جو تتلی کو دیکھ کر حیران ہوتی ہے"
    },
    {
      "name": "دادا",
      "description": "بچوں کے دادا جو انہیں قدرت کے بارے میں سکھاتے ہیں"
    }
  ],
  "summary": "یہ کہانی علی اور زینب کی ہے جو اپنے دادا کے باغ میں کھیلتے ہوئے تتلی کو دیکھتے ہیں۔ دادا انہیں بتاتے ہیں کہ تتلیاں پھولوں کی افزائش میں کتنی اہم ہیں۔",
  "difficult_words": [
    {
      "word": "پولینیشن",
      "meaning": "pollination",
      "example": "پھولوں کی پولینیشن"
    },
    {
      "word": "پولن",
      "meaning": "pollen",
      "example": "پھولوں کا پولن"
    },
    {
      "word": "پھڑپھڑانا",
      "meaning": "flutter",
      "example": "پروں کو پھڑپھڑانا"
    },
    {
      "word": "افزائش",
      "meaning": "growth",
      "example": "پھولوں کی افزائش"
    }
  ],
  "moral": "قدرت میں ہر چھوٹا جاندار اپنا اہم کردار ادا کرتا ہے۔",
  "difficulty_level": "beginner",
  "age_group": "6-10",
  "theme": "قدرت اور جاندار"
} 