{
  "title": "چاند کی کہانی",
  "content": "چاند کی کہانی\n\nایک چھوٹا سا بچہ رات کو اپنی کھڑکی سے چاند کو دیکھ رہا تھا۔ چاند بہت خوبصورت لگ رہا تھا۔\n\n\"امی، چاند کتنا خوبصورت ہے!\" بچے نے کہا۔\n\n\"ہاں بیٹا،\" امی نے جواب دیا۔ \"چاند ہمیشہ ہمارے ساتھ رہتا ہے۔ کبھی وہ گول ہوتا ہے، کبھی آدھا، اور کبھی صرف ایک چھوٹی سی لکیر۔\"\n\nبچے نے حیرت سے پوچھا، \"لیکن کیوں؟\"\n\nامی نے مسکراتے ہوئے کہا، \"چاند ہمیشہ گھومتا رہتا ہے۔ جب وہ سورج کے سامنے آتا ہے تو ہم اسے پورا دیکھتے ہیں۔ جب وہ پیچھے ہوتا ہے تو ہم اسے آدھا دیکھتے ہیں۔ اور جب وہ بہت پیچھے ہوتا ہے تو ہم اسے صرف ایک چھوٹی سی لکیر کی طرح دیکھتے ہیں۔\"\n\nبچے نے کہا، \"واہ! یہ تو بہت دلچسپ ہے۔\"\n\nامی نے کہا، \"ہاں بیٹا، یہ قدرت کا ایک خوبصورت معجزہ ہے۔ چاند ہماری راتوں کو روشن کرتا ہے اور ہمیں سکون دیتا ہے۔\"\n\nبچے نے چاند کو دیکھتے ہوئے کہا، \"میں چاند سے بہت پیار کرتا ہوں۔\"\n\nامی نے اسے گلے لگا لیا اور کہا، \"اور چاند بھی تم سے پیار کرتا ہے۔\"",
  "lesson": "اس کہانی سے ہمیں یہ سبق ملتا ہے کہ قدرت کے معجزات کو سمجھنا اور ان کی خوبصورتی کو دیکھنا بہت اہم ہے۔ چاند کی مختلف شکلیں ہمیں سکھاتی ہیں کہ ہر چیز کا اپنا ایک نظام ہے۔",
  "characters": [
    {
      "name": "بچہ",
      "description": "ایک چھوٹا بچہ جو چاند کو دیکھ کر حیران ہوتا ہے"
    },
    {
      "name": "امی",
      "description": "بچے کی ماں جو اسے چاند کے بارے میں سکھاتی ہے"
    }
  ],
  "summary": "یہ کہانی ایک چھوٹے بچے کی ہے جو چاند کو دیکھ کر حیران ہوتا ہے۔ اس کی ماں اسے چاند کی مختلف شکلوں کے بارے میں بتاتی ہے اور قدرت کے معجزے کو سمجھاتی ہے۔",
  "difficult_words": [
    {
      "word": "حیرت",
      "meaning": "surprise",
      "example": "حیرت سے پوچھنا"
    },
    {
      "word": "معجزہ",
      "meaning": "miracle",
      "example": "قدرت کا معجزہ"
    },
    {
      "word": "سکون",
      "meaning": "peace",
      "example": "سکون دینا"
    },
    {
      "word": "دلچسپ",
      "meaning": "interesting",
      "example": "دلچسپ بات"
    }
  ],
  "moral": "قدرت کے معجزات کو سمجھنا اور ان کی خوبصورتی کو دیکھنا بہت اہم ہے۔",
  "difficulty_level": "beginner",
  "age_group": "6-10",
  "theme": "قدرت اور معجزات"
} 