{
  "title": "ایک اچھا دوست",
  "content": "ایک اچھا دوست\n\nامنہ اور سلمٰی دو دوست تھیں۔ وہ ہر روز ساتھ اسکول جاتی تھیں۔ ایک دن، امنہ کو اسکول میں ایک مشکل کام ملا۔ اسے ایک تصویر بنانی تھی۔\n\n\"مجھے تصویر بنانا نہیں آتا،\" امنہ نے پریشانی سے کہا۔\n\n\"فکر مت کرو،\" سلمٰی نے کہا۔ \"میں تمہاری مدد کروں گی۔\"\n\nاگلے دن، سلمٰی اپنے ساتھ رنگین پنسلیں اور پینٹ لائی۔ دونوں دوست سلمٰی کے گھر گئے۔ سلمٰی نے امنہ کو تصویر بنانا سکھایا۔\n\n\"دیکھو، پہلے ہلکے ہاتھ سے لکیریں کھینچو،\" سلمٰی نے کہا۔\n\nامنہ نے کوشش کی۔ پھر انہوں نے رنگ بھرنا شروع کیا۔ سلمٰی نے صبر سے امنہ کی مدد کی۔\n\n\"یہ بہت خوبصورت ہے!\" سلمٰی نے کہا جب تصویر مکمل ہوئی۔\n\nامنہ نے مسکراتے ہوئے کہا، \"شکریہ میری مدد کرنے کے لیے۔ تم ایک اچھی دوست ہو۔\"\n\n\"یہی تو دوست کرتے ہیں،\" سلمٰی نے جواب دیا۔ \"وہ ایک دوسرے کی مدد کرتے ہیں۔\"\n\nامنہ کی تصویر کو اسکول میں بہت پسند کیا گیا۔ اس نے اپنے استاد اور دوسرے بچوں کو بتایا کہ سلمٰی نے اس کی کتنی مدد کی تھی۔ استاد نے دونوں کی تعریف کی - امنہ کی اس کی خوبصورت تصویر کے لیے اور سلمٰی کی ایک اچھی دوست ہونے کے لیے۔",
  "lesson": "اس کہانی سے ہمیں یہ سبق ملتا ہے کہ اچھا دوست وہ ہوتا ہے جو مشکل وقت میں مدد کرتا ہے۔ دوستی میں ایک دوسرے کی مدد کرنا اور صبر سے سکھانا بہت اہم ہے۔",
  "characters": [
    {
      "name": "امنہ",
      "description": "ایک بچی جو تصویر بنانا سیکھنا چاہتی ہے"
    },
    {
      "name": "سلمٰی",
      "description": "ایک اچھی دوست جو امنہ کی مدد کرتی ہے"
    }
  ],
  "summary": "یہ کہانی امنہ اور سلمٰی کی دوستی کی ہے۔ امنہ کو تصویر بنانے میں مشکل ہوتی ہے تو سلمٰی اس کی مدد کرتی ہے اور اسے صبر سے سکھاتی ہے۔",
  "difficult_words": [
    {
      "word": "پریشانی",
      "meaning": "worry",
      "example": "پریشانی سے کہنا"
    },
    {
      "word": "صبر",
      "meaning": "patience",
      "example": "صبر سے مدد کرنا"
    },
    {
      "word": "تعریف",
      "meaning": "praise",
      "example": "تعریف کرنا"
    },
    {
      "word": "خوبصورت",
      "meaning": "beautiful",
      "example": "خوبصورت تصویر"
    }
  ],
  "moral": "اچھا دوست وہ ہوتا ہے جو مشکل وقت میں مدد کرتا ہے۔",
  "difficulty_level": "beginner",
  "age_group": "6-10",
  "theme": "دوستی اور مدد"
} 