{
  "title": "ہاتھی اور چیونٹی",
  "content": "ہاتھی اور چیونٹی\n\nایک جنگل میں ایک بہت بڑا ہاتھی رہتا تھا۔ وہ اپنے آپ کو سب سے طاقتور سمجھتا تھا۔ ایک دن وہ ایک چھوٹی سی چیونٹی کے پاس سے گزر رہا تھا۔\n\n\"اوہو! تم تو بہت چھوٹی ہو،\" ہاتھی نے چیونٹی سے کہا۔ \"تم کچھ بھی نہیں کر سکتیں۔\"\n\nچیونٹی نے جواب دیا، \"چھوٹا ہونا کوئی کمزوری نہیں ہے۔ ہر ایک کی اپنی طاقت ہوتی ہے۔\"\n\nہاتھی ہنس پڑا، \"ہا ہا ہا! تمہاری کیا طاقت ہو سکتی ہے؟\"\n\nچیونٹی نے کہا، \"چلو، میں تمہیں دکھاتی ہوں۔\"\n\nچیونٹی نے ہاتھی کی سونڈ پر چڑھنا شروع کیا۔ ہاتھی نے اسے ہٹانے کی کوشش کی، لیکن چیونٹی بہت چالاک تھی۔ وہ ہاتھی کی سونڈ میں گھس گئی۔\n\nہاتھی کو بہت خارش ہونے لگی۔ وہ ادھر ادھر بھاگنے لگا۔ آخر کار اس نے چیونٹی سے معافی مانگی۔\n\n\"معاف کر دو،\" ہاتھی نے کہا۔ \"میں نے غلطی کی۔ چھوٹا ہونا بھی ایک طاقت ہے۔\"\n\nچیونٹی نے مسکرا کر کہا، \"ہاں، ہر ایک کی اپنی اہمیت ہے۔ بڑا ہو یا چھوٹا، ہر ایک کچھ نہ کچھ کر سکتا ہے۔\"\n\nاس دن کے بعد ہاتھی نے کبھی کسی کو اس کی چھوٹی جسامت کی وجہ سے کم نہیں سمجھا۔",
  "lesson": "اس کہانی سے ہمیں یہ سبق ملتا ہے کہ ہر شخص کی اپنی اہمیت اور طاقت ہوتی ہے۔ چھوٹا ہونا یا بڑا ہونا کوئی کمزوری نہیں ہے۔ ہمیں دوسروں کو ان کی جسامت یا طاقت کی بنیاد پر کم نہیں سمجھنا چاہیے۔",
  "characters": [
    {
      "name": "ہاتھی",
      "description": "بڑا اور طاقتور جانور جو ابتدا میں مغرور تھا"
    },
    {
      "name": "چیونٹی",
      "description": "چھوٹی لیکن ہوشیار اور چالاک جانور"
    }
  ],
  "summary": "یہ کہانی ایک ہاتھی اور چیونٹی کی ہے جس میں ہاتھی چیونٹی کو اس کی چھوٹی جسامت کی وجہ سے کم سمجھتا ہے، لیکن چیونٹی اپنی ہوشیاری سے ہاتھی کو سکھاتی ہے کہ ہر ایک کی اپنی اہمیت ہوتی ہے۔",
  "difficult_words": [
    {
      "word": "طاقتور",
      "meaning": "powerful",
      "example": "طاقتور ہاتھی"
    },
    {
      "word": "چالاک",
      "meaning": "clever",
      "example": "چالاک چیونٹی"
    },
    {
      "word": "جسامت",
      "meaning": "size",
      "example": "چھوٹی جسامت"
    },
    {
      "word": "اہمیت",
      "meaning": "importance",
      "example": "ہر ایک کی اپنی اہمیت"
    }
  ],
  "moral": "ہر شخص کی اپنی اہمیت اور طاقت ہوتی ہے، چھوٹا ہو یا بڑا۔",
  "difficulty_level": "beginner",
  "age_group": "6-10",
  "theme": "ہر ایک کی اہمیت اور خود اعتمادی"
} 