{
  "title": "جھیل پر آیا ہاتھی",
  "content": "ایک دن کی بات ہے کہ ایک ہاتھی جنگل کی جھیل پر پہنچا۔ جھیل کا پانی بالکل صاف تھا۔ ہاتھی جھیل کے کنارے کھڑا ہوگیا۔ جھیل میں جب اس نے اپنی تصویر دیکھی تو وہ بہت خوش ہوا۔ اسی دوران ایک ہرن بھی اپنی پیاس بُجھانے کے لیے جھیل پر آیا۔ ہرن نے ہاتھی سے پوچھا کہ کیا بات ہے ہاتھی بھائی، آپ یہاں کیسے آئے۔\nہاتھی بولا کہ میں یہاں جھیل میں اپنی تصویر دیکھنے آیا ہوں۔ ہرن جھیل کے کنارے پانی پینے لگا تو ہاتھی نے جھیل کا پانی اپنی سونڈ سے اِدھر اُدھر اُچھالنا شروع کر دیا۔ پانی کی لہروں کی وجہ سے اُس کی تصویر آپس میں ٹکرانے لگی۔\nہرن بولا، ہاتھی بھائی آپ تو بڑے ہوشیار بنتے ہو، لیکن دیکھو کیا کر دیا۔ پانی گندا کر دیا اور تصویر بھی بگاڑ دی۔ اب تم اپنی تصویر دیکھنا چاہتے تھے، سو بگاڑ دی۔ اور میں پانی پینا چاہتا تھا، سو مجھے پانی بھی نہ مِلا۔\nہاتھی اپنی حرکت پر شرمندہ ہوا۔ اُس نے پانی کو شانت ہونے دیا۔ پانی کی لہریں شانت ہوئیں تو اُس کی صورت پھر جھیل میں نظر آنے لگی۔ اور ہرن بھی پانی پی کر اپنی پیاس بُجھانے لگا۔\nاس کہانی سے ہمیں یہ سبق ملتا ہے کہ ہمیں دوسروں کا بھی خیال رکھنا چاہیے۔",
  "lesson": "اس کہانی سے ہمیں یہ سبق ملتا ہے کہ ہمیں دوسروں کا بھی خیال رکھنا چاہیے۔ اپنی خوشی کے لیے دوسروں کو تکلیف نہیں پہنچانی چاہیے۔",
  "characters": [
    {
      "name": "ہاتھی",
      "description": "ایک ہاتھی جو جھیل میں اپنی تصویر دیکھنا چاہتا ہے"
    },
    {
      "name": "ہرن",
      "description": "ایک ہرن جو پیاس بجھانے کے لیے جھیل پر آیا ہے"
    }
  ],
  "summary": "یہ کہانی ایک ہاتھی کی ہے جو جھیل میں اپنی تصویر دیکھنا چاہتا ہے۔ وہ پانی کو اچھال کر ہرن کو پانی پینے سے روک دیتا ہے، لیکن پھر اپنی غلطی کا احساس کرتا ہے۔",
  "difficult_words": [
    {
      "word": "پیاس",
      "meaning": "thirst",
      "example": "پیاس بجھانا"
    },
    {
      "word": "شانت",
      "meaning": "calm",
      "example": "پانی شانت ہونا"
    },
    {
      "word": "شرمندہ",
      "meaning": "ashamed",
      "example": "اپنی حرکت پر شرمندہ ہونا"
    },
    {
      "word": "اچھالنا",
      "meaning": "splash",
      "example": "پانی اچھالنا"
    }
  ],
  "moral": "دوسروں کا خیال رکھنا چاہیے اور اپنی خوشی کے لیے دوسروں کو تکلیف نہیں پہنچانی چاہیے۔",
  "difficulty_level": "beginner",
  "age_group": "6-10",
  "theme": "دوسروں کا خیال رکھنا"
}