{
  "title": "نادانی کا انجام",
  "content": "اگر آپ فطرت کے قانون کے خلاف کچھ کریں گے تو اس کا نتیجہ ہمیشہ خراب ہوگا\n\nایک دفعہ کا ذکر ہے کہ ایک نادان شیر نے اپنی بادشاہت کے دیگر جانوروں پر ظلم کرنا شروع کر دیا ۔ روزانہ وہ ضرورت سے زیادہ جانوروں کو شکار کرتا اور پھر پیٹ بھر کر کھانے کے بعد اسراف کرتا ۔\n\nایک دن ایک چالاک خرگوش نےشیر کو کہا ، \"آپ اگر اس طرح روزانہ بہت سے جانوروں کو کھائیں گے تو کچھ ہی عرصے میں یہاں کوئی جانور نہیں رہے گا اور آپ بھوکے مر جائیں گے۔\"\n\nیہ سن کر شیر نے کہا ، \"تو پھر میں کیا کھاؤں؟\"\n\nخرگوش بولا ، \"میری رائے میں آپ گھاس کھائیں ۔ یہ آپ کو سیر کرے گی اور جانوروں کی جان بھی بچ جائے گی۔\"\n\nشیر نے سمجھا کہ خرگوش درست کہہ رہا ہے ۔ اس نے اور باقی گوشت خوار جانوروں نے گھاس کھانا شروع کر دی۔ چند دنوں میں ہی شیر اور دیگر گوشت خور جانور بیمار ہونے لگے۔ ان کی آنتیں گھاس ہضم نہیں کر پا رہی تھیں اور وہ کمزور ہوتے جا رہے تھے۔\n\nتب ایک بوڑھے شیر نے کہا ، \"ہماری قدرت نے ہمیں گوشت کھانے کے لیے بنایا ہے ۔ اگر آپ فطرت کے قانون کے خلاف کچھ کریں گے تو اس کا نتیجہ ہمیشہ خراب ہوگا۔\"\n\nشیر نے غلطی مان لی اور دوبارہ گوشت کھانا شروع کیا، لیکن اب وہ صرف ضرورت کے مطابق ہی شکار کرتا تھا اور اسراف سے بچتا تھا۔",
  "lesson": "اس کہانی سے ہمیں یہ سبق ملتا ہے کہ فطرت کے قوانین کے خلاف جانا ہمیشہ نقصان دہ ہوتا ہے۔ ہمیں اپنی فطرت کے مطابق ہی کام کرنا چاہیے اور دوسروں کی نصیحت کو غور سے سننا چاہیے۔",
  "characters": [
    {
      "name": "شیر",
      "description": "ایک نادان شیر جو ضرورت سے زیادہ شکار کرتا ہے"
    },
    {
      "name": "خرگوش",
      "description": "ایک چالاک خرگوش جو شیر کو نصیحت کرتا ہے"
    },
    {
      "name": "بوڑھا شیر",
      "description": "ایک تجربہ کار شیر جو شیر کو صحیح راہ دکھاتا ہے"
    }
  ],
  "summary": "یہ کہانی ایک نادان شیر کی ہے جو ضرورت سے زیادہ شکار کرتا ہے۔ خرگوش اسے گھاس کھانے کی نصیحت کرتا ہے، لیکن یہ فطرت کے خلاف ہے۔ آخر کار بوڑھا شیر اسے صحیح راہ دکھاتا ہے۔",
  "difficult_words": [
    {
      "word": "نادانی",
      "meaning": "foolishness",
      "example": "نادانی کا انجام"
    },
    {
      "word": "اسراف",
      "meaning": "waste",
      "example": "اسراف کرنا"
    },
    {
      "word": "فطرت",
      "meaning": "nature",
      "example": "فطرت کا قانون"
    },
    {
      "word": "ہضم",
      "meaning": "digest",
      "example": "گھاس ہضم نہ کرنا"
    }
  ],
  "moral": "فطرت کے قوانین کے خلاف جانا ہمیشہ نقصان دہ ہوتا ہے۔",
  "difficulty_level": "intermediate",
  "age_group": "8-12",
  "theme": "فطرت کے قوانین اور نصیحت"
}