{
  "title": "نیا موسم",
  "content": "نیا موسم\n\nباران اور کالے بادلوں سے خوشگوار موسم ہو گیا تھا۔ بچے باہر کھیلنے کے لیے جانے لگے تھے۔ لیکن ان میں سے ایک بچہ، دانی، ابھی بھی اپنے گھر میں ہی رہنا چاہتا تھا۔\n\nدانی کے دوست قمر نے اس سے پوچھا، \"دانی، تم باہر کیوں نہیں آتے؟ باہر بہت مزہ آ رہا ہے۔\"\n\nدانی نے جواب دیا، \"مجھے ٹھنڈ لگتی ہے اور میں بیمار ہو جاؤں گا۔\"\n\nقمر نے اسے سمجھایا، \"گرم کپڑے پہن لو، پھر تمہیں ٹھنڈ نہیں لگے گی۔\"\n\nدانی نے پھر کہا، \"لیکن باہر کیچڑ ہے اور میرے جوتے خراب ہو جائیں گے۔\"\n\nقمر نے مسکرا کر کہا، \"اپنے پرانے جوتے پہن لو، جو خراب ہونے سے تمہیں فکر نہ ہو۔\"\n\nدانی نے ایک اور بہانہ بنایا، \"لیکن اگر بارش شروع ہو گئی تو؟\"\n\nقمر نے جواب دیا، \"ہم سب کے پاس چھتریاں ہیں، میں تمہارے لیے بھی ایک لے کر آیا ہوں۔\"\n\nآخر کار دانی نے اپنے گرم کپڑے پہنے، پرانے جوتے پہنے، چھتری اٹھائی اور باہر چلا گیا۔ باہر پہنچتے ہی اس نے دیکھا کہ سب بچے کتنی خوشی سے کھیل رہے ہیں۔ وہ بھی ان میں شامل ہو گیا اور اسے اتنا مزا آیا کہ وہ شام تک کھیلتا رہا۔\n\nگھر واپس آتے ہوئے اس نے قمر سے کہا، \"شکریہ دوست، تم نے مجھے سکھایا کہ بہانے بنانے کی بجائے مشکلات کا حل نکالنا چاہیے۔ مجھے آج بہت مزا آیا۔\"",
  "lesson": "اس کہانی سے ہمیں یہ سبق ملتا ہے کہ مشکلات کا سامنا کرنے کی بجائے بہانے بنانا آسان ہے، لیکن اگر ہم مشکلات کا حل نکالیں تو ہمیں بہت فائدہ ہوتا ہے۔",
  "characters": [
    {
      "name": "دانی",
      "description": "ایک بچہ جو شروع میں باہر جانے سے ڈرتا ہے"
    },
    {
      "name": "قمر",
      "description": "دانی کا دوست جو اسے مشکلات کا حل نکالنے میں مدد کرتا ہے"
    }
  ],
  "summary": "یہ کہانی دانی نامی بچے کی ہے جو بارش کے موسم میں باہر جانے سے ڈرتا ہے۔ اس کا دوست قمر اسے مختلف مشکلات کا حل نکالنے میں مدد کرتا ہے اور آخر کار دانی کو باہر کھیلنے میں بہت مزا آتا ہے۔",
  "difficult_words": [
    {
      "word": "خوشگوار",
      "meaning": "pleasant",
      "example": "خوشگوار موسم"
    },
    {
      "word": "بہانہ",
      "meaning": "excuse",
      "example": "بہانہ بنانا"
    },
    {
      "word": "چھتری",
      "meaning": "umbrella",
      "example": "بارش سے بچنے کے لیے چھتری"
    },
    {
      "word": "مشکلات",
      "meaning": "difficulties",
      "example": "مشکلات کا حل نکالنا"
    }
  ],
  "moral": "مشکلات کا سامنا کرنے کی بجائے ان کا حل نکالنا چاہیے۔",
  "difficulty_level": "beginner",
  "age_group": "6-10",
  "theme": "مشکلات کا حل اور دوستی"
}