{
  "title": "ٹھنڈا پانی",
  "content": "ٹھنڈا پانی\n\nگرمیوں کا موسم تھا۔ سورج تیز چمک رہا تھا۔ سارا، علی، اور فاطمہ کھیلنے کے بعد بہت پیاسے تھے۔\n\n\"مجھے بہت پیاس لگی ہے،\" سارا نے کہا۔\n\n\"میں بھی پانی پینا چاہتا ہوں،\" علی نے جواب دیا۔\n\n\"چلو، میرے گھر چلتے ہیں۔ میری ماں نے ٹھنڈا پانی فریج میں رکھا ہے،\" فاطمہ نے کہا۔\n\nتینوں دوست فاطمہ کے گھر گئے۔ فاطمہ نے فریج سے ٹھنڈے پانی کی بوتل نکالی۔ اس نے پانی کے گلاس بھرے اور اپنے دوستوں کو دیے۔\n\n\"آہ! یہ پانی کتنا ٹھنڈا اور تازہ ہے،\" سارا نے خوشی سے کہا۔\n\n\"شکریہ فاطمہ،\" علی نے کہا۔ \"گرمی میں ٹھنڈا پانی پینا کتنا اچھا لگتا ہے۔\"\n\nفاطمہ نے مسکرا کر کہا، \"دوستوں کے ساتھ ٹھنڈا پانی شیئر کرنا اور بھی اچھا ہے۔\"\n\nسارا نے کہا، \"ہم پانی پینے کے بعد فاطمہ کی مدد کریں گے تاکہ اس کی ماں کو واپس آنے پر صاف ستھرا گھر ملے۔\"\n\nتینوں دوستوں نے گلاس دھوئے اور کچن صاف کیا۔ پھر انہوں نے ساتھ میں کھیلنا جاری رکھا، خوش اور تازہ دم محسوس کرتے ہوئے۔",
  "lesson": "اس کہانی سے ہمیں یہ سبق ملتا ہے کہ دوستی میں شیئرنگ اور مدد کرنا بہت اہم ہے۔ جب ہم دوسروں کی مدد کرتے ہیں تو یہ ہمارے تعلقات کو اور بھی مضبوط بناتا ہے۔",
  "characters": [
    {
      "name": "سارا",
      "description": "ایک دوست جو پیاس کی وجہ سے پانی پینا چاہتی ہے"
    },
    {
      "name": "علی",
      "description": "ایک دوست جو پیاس کی وجہ سے پانی پینا چاہتا ہے"
    },
    {
      "name": "فاطمہ",
      "description": "ایک دوست جو اپنے گھر سے ٹھنڈا پانی شیئر کرتی ہے"
    }
  ],
  "summary": "یہ کہانی تین دوستوں کی ہے جو کھیلنے کے بعد پیاسے ہوتے ہیں۔ فاطمہ اپنے گھر سے ٹھنڈا پانی شیئر کرتی ہے اور پھر سب مل کر گھر کی صفائی کرتے ہیں۔",
  "difficult_words": [
    {
      "word": "پیاس",
      "meaning": "thirst",
      "example": "پیاس لگنا"
    },
    {
      "word": "تازہ دم",
      "meaning": "refreshed",
      "example": "تازہ دم محسوس کرنا"
    },
    {
      "word": "شیئر",
      "meaning": "share",
      "example": "پانی شیئر کرنا"
    },
    {
      "word": "صاف ستھرا",
      "meaning": "clean and tidy",
      "example": "صاف ستھرا گھر"
    }
  ],
  "moral": "دوستی میں شیئرنگ اور مدد کرنا بہت اہم ہے۔",
  "difficulty_level": "beginner",
  "age_group": "6-10",
  "theme": "دوستی اور تعاون"
} 